# SERIES

In [1]:
import pandas as pd
import numpy as np

In [4]:
# Craete a list
labels=['a','b','c','d']
mydata=[10,20,30,40]
# convert data into array
arr=np.array(mydata)
# creating a dictionary
d={'a':10,'b':20,'c':30,'d':40}
S=pd.Series(mydata,index=labels)
print("Labels",labels)
print("Data",mydata)
print("Dictionary",d)
print("Series")
print(S)

Labels ['a', 'b', 'c', 'd']
Data [10, 20, 30, 40]
Dictionary {'a': 10, 'b': 20, 'c': 30, 'd': 40}
Series
a    10
b    20
c    30
d    40
dtype: int64

In [5]:
# convert list into series we use pd.Series(list,index=...)
pd.Series(mydata)

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
pd.Series(mydata,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [9]:
pd.Series(mydata,index=[1,"abc",3,"xyz"])

1      10
abc    20
3      30
xyz    40
dtype: int64

In [12]:
S['a']

10

In [13]:
# Convert an array into the series
arr=np.array(mydata)
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int32

In [14]:
# convert dictionary into a series
d={'a':10,'b':20,'c':30,'d':40}
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

In [15]:
pd.Series(d,index=['e','f','g','h']) #it showa nan becuase in dictionary no such index matches since it does mapping

e   NaN
f   NaN
g   NaN
h   NaN
dtype: float64

In [19]:
S[0:3]

a    10
b    20
c    30
dtype: int64

In [20]:
S[0:3:2]

a    10
c    30
dtype: int64

In [23]:
# Addition of 2 series
s1=pd.Series([1,2,3,4],index=["a","b","c","a"])
s2=pd.Series([1,2,3,4],index=["b","a","c","w"])
s1+s2

a    3.0
a    6.0
b    3.0
c    6.0
w    NaN
dtype: float64

In [24]:
# multiplication of 2 series
s1*s2

a    2.0
a    8.0
b    2.0
c    9.0
w    NaN
dtype: float64

# DATAFRAME

In [17]:
pd.DataFrame(d,index=['a','b','c','d'])

    a   b   c   d
a  10  20  30  40
b  10  20  30  40
c  10  20  30  40
d  10  20  30  40

In [25]:
## creating random data using numpy
from numpy.random import rand as rn

In [27]:
rn(5,3)

array([[0.38499261, 0.43970161, 0.32621057],
       [0.33063704, 0.85493553, 0.06094734],
       [0.25560313, 0.1749418 , 0.09917541],
       [0.16666235, 0.78998781, 0.63060886],
       [0.33031813, 0.69629882, 0.19543143]])

In [32]:
df=pd.DataFrame(rn(5,3),index=["a","b","c","d","e"],columns=["1st","2nd","3rd"])
df

        1st       2nd       3rd
a  0.811615  0.777882  0.060907
b  0.268246  0.179474  0.253115
c  0.740909  0.711903  0.795215
d  0.694641  0.556598  0.481618
e  0.722422  0.751264  0.397845

In [31]:
df.iloc[0]

1st    0.221168
2nd    0.024173
3rd    0.083536
Name: a, dtype: float64

In [33]:
df.loc["e"]

1st    0.722422
2nd    0.751264
3rd    0.397845
Name: e, dtype: float64

In [34]:
df[["1st","2nd"]]

        1st       2nd
a  0.811615  0.777882
b  0.268246  0.179474
c  0.740909  0.711903
d  0.694641  0.556598
e  0.722422  0.751264

In [35]:
df["new"]=df["1st"]+df["2nd"]

In [36]:
df

        1st       2nd       3rd       new
a  0.811615  0.777882  0.060907  1.589497
b  0.268246  0.179474  0.253115  0.447720
c  0.740909  0.711903  0.795215  1.452812
d  0.694641  0.556598  0.481618  1.251239
e  0.722422  0.751264  0.397845  1.473686

In [40]:
df.drop("new",inplace=True,axis=1)

In [41]:
df

        1st       2nd       3rd
a  0.811615  0.777882  0.060907
b  0.268246  0.179474  0.253115
c  0.740909  0.711903  0.795215
d  0.694641  0.556598  0.481618
e  0.722422  0.751264  0.397845

In [43]:
df.loc[["a","b"]]["3rd"]

a    0.060907
b    0.253115
Name: 3rd, dtype: float64

In [44]:
df.loc[["a","b"],"3rd"]

a    0.060907
b    0.253115
Name: 3rd, dtype: float64

In [47]:
df.iloc[0:2,2:4]

        3rd
a  0.060907
b  0.253115

In [48]:
df

        1st       2nd       3rd
a  0.811615  0.777882  0.060907
b  0.268246  0.179474  0.253115
c  0.740909  0.711903  0.795215
d  0.694641  0.556598  0.481618
e  0.722422  0.751264  0.397845

In [49]:
print(df>0.5)

     1st    2nd    3rd
a   True   True  False
b  False  False  False
c   True   True   True
d   True   True  False
e   True   True  False

In [50]:
df[df>0.5]

        1st       2nd       3rd
a  0.811615  0.777882       NaN
b       NaN       NaN       NaN
c  0.740909  0.711903  0.795215
d  0.694641  0.556598       NaN
e  0.722422  0.751264       NaN

In [54]:
df.loc["a"]>0.5

1st     True
2nd     True
3rd    False
Name: a, dtype: bool

In [56]:
#3 creating a matrix
matrix_data=np.matrix('22,66,140;42,70,150;33,66,155;25,62,152')
row_labels=["A","B","C","D"]
column_labels=["Age","Weight","Height"]
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 150],
        [ 33,  66, 155],
        [ 25,  62, 152]])

In [57]:
mdf=pd.DataFrame(matrix_data,index=row_labels,columns=column_labels)
mdf

   Age  Weight  Height
A   22      66     140
B   42      70     150
C   33      66     155
D   25      62     152

In [60]:
mdf[mdf["Height"]>150]

   Age  Weight  Height
C   33      66     155
D   25      62     152

In [63]:
mdf[(mdf["Height"]>150) & (mdf["Weight"]>60)]

   Age  Weight  Height
C   33      66     155
D   25      62     152

In [65]:
mdf[(mdf["Height"]>150) | (mdf["Weight"]>60)]

   Age  Weight  Height
A   22      66     140
B   42      70     150
C   33      66     155
D   25      62     152

In [68]:
mdf.reset_index(drop=True,inplace=True)

In [69]:
mdf

   Age  Weight  Height
0   22      66     140
1   42      70     150
2   33      66     155
3   25      62     152

In [70]:
mdf.set_index("Weight")

        Age  Height
Weight
66       22     140
70       42     150
66       33     155
62       25     152

In [75]:
mdf["ABC"]=["A",'B','A','C']
mdf

   Age  Weight  Height ABC
0   22      66     140   A
1   42      70     150   B
2   33      66     155   A
3   25      62     152   C

In [78]:
index=list(zip(mdf["ABC"],mdf["Height"]))

In [82]:
index=pd.MultiIndex.from_tuples(index)

In [83]:
mdf.set_index(index)

       Age  Weight  Height ABC
A 140   22      66     140   A
B 150   42      70     150   B
A 155   33      66     155   A
C 152   25      62     152   C

In [85]:
df1 = pd.DataFrame(data=np.round(rn(4,3)), index= index, columns= ['A','B','C'])

In [86]:
df1

         A    B    C
A 140  0.0  1.0  0.0
B 150  0.0  1.0  0.0
A 155  0.0  0.0  1.0
C 152  0.0  1.0  1.0